In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:WECHALE$0398_wess@localhost:3306/loan_1

Connecting to 'mysql+pymysql://root:***@localhost:3306/loan_1'

In [3]:
%%sql

SELECT * FROM loan_data_clean LIMIT 5;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

5 rows affected.

+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
| MyUnknownColumn | Gender | Married | Dependents | Education | Self_Employed | ApplicantIncome | CoapplicantIncome |     LoanAmount     | Loan_Amount_Term | Credit_History | Property_Area | Loan_Status |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+
|        0        |   1    |    0    |    0.0     |     0     |       0       |       376       |        0.0        | 146.41216216216216 |      360.0       |      1.0       |       2       |      1      |
|        1        |   1    |    1    |    1.0     |     0     |       0       |       306       |       1508.0      |       128.0        |      360.0       |      1.0       |       0       |      0      |
|        2        |   1    |    1    |    0.0     |     0     |       1       |       139       |        0.0        |        66.0        |      360.0       |      1.0       |       2       |      1      |
|        3        |   1    |    1    |    0.0     |     1     |       0       |        90       |       2358.0      |       120.0        |      360.0       |      1.0       |       2       |      1      |
|        4        |   1    |    0    |    0.0     |     0     |       0       |       381       |        0.0        |       141.0        |      360.0       |      1.0       |       2       |      1      |
+-----------------+--------+---------+------------+-----------+---------------+-----------------+-------------------+--------------------+------------------+----------------+---------------+-------------+

In [4]:
%%sql

SELECT COUNT(*) as total_records FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+---------------+
| total_records |
+---------------+
|      614      |
+---------------+

In [5]:
%%sql

SELECT DISTINCT loan_status FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+
| loan_status |
+-------------+
|      1      |
|      0      |
+-------------+

In [6]:
%%sql

SELECT Loan_Status, COUNT(*) as count FROM loan_data_clean GROUP BY Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+-------+
| Loan_Status | count |
+-------------+-------+
|      1      |  422  |
|      0      |  192  |
+-------------+-------+

In [7]:
%%sql

SELECT Loan_Status,
       MIN(LoanAmount) as Minimum, 
       MAX(LoanAmount) as Maximum,
       AVG(LoanAmount) as Average

FROM loan_data_clean
GROUP BY Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+---------+---------+--------------------+
| Loan_Status | Minimum | Maximum |      Average       |
+-------------+---------+---------+--------------------+
|      1      |   17.0  |  700.0  | 144.34960612271036 |
|      0      |   9.0   |  570.0  | 150.94548845720723 |
+-------------+---------+---------+--------------------+

In [11]:
%%sql

SELECT AVG(ApplicantIncome) as Average_Income 
FROM loan_data_clean

WHERE Loan_Status = 1;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+----------------+
| Average_Income |
+----------------+
|    246.8152    |
+----------------+

In [12]:
%%sql

SELECT AVG(ApplicantIncome) as Average_Income 
FROM loan_data_clean

WHERE Loan_Status = 0;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+----------------+
| Average_Income |
+----------------+
|    247.7813    |
+----------------+

In [13]:
%%sql

SELECT AVG(ApplicantIncome) as Average_Income 
FROM loan_data_clean

group by Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+----------------+
| Average_Income |
+----------------+
|    246.8152    |
|    247.7813    |
+----------------+

In [16]:
%%sql

SELECT Loan_Status,
AVG(LoanAmount) as Average_Loan_Amount
FROM loan_data_clean

GROUP BY Loan_Status;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-------------+---------------------+
| Loan_Status | Average_Loan_Amount |
+-------------+---------------------+
|      1      |  144.34960612271036 |
|      0      |  150.94548845720723 |
+-------------+---------------------+

In [17]:
%%sql

SELECT MIN(LoanAmount) as MINIMUM_LOAN_AMOUNT,
MAX(LoanAmount)as MAXIMUM_LOAN_AMOUNT,
AVG(LoanAmount) as AVERAGE_LOAN_AMOUNT

FROM loan_data_clean;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

1 rows affected.

+---------------------+---------------------+---------------------+
| MINIMUM_LOAN_AMOUNT | MAXIMUM_LOAN_AMOUNT | AVERAGE_LOAN_AMOUNT |
+---------------------+---------------------+---------------------+
|         9.0         |        700.0        |  146.41216216216213 |
+---------------------+---------------------+---------------------+

In [19]:
%%sql

SELECT Property_Area, COUNT(*) as Count 

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------+
| Property_Area | Count |
+---------------+-------+
|       2       |  202  |
|       0       |  179  |
|       1       |  233  |
+---------------+-------+

In [21]:
%%sql

SELECT Education, COUNT(*) as Count

FROM Loan_data_clean

GROUP BY Education;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

2 rows affected.

+-----------+-------+
| Education | Count |
+-----------+-------+
|     0     |  480  |
|     1     |  134  |
+-----------+-------+

In [24]:
%%sql

SELECT Married, COUNT(*) as Count

FROM loan_data_clean

GROUP BY Married;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------+-------+
| Married | Count |
+---------+-------+
|    0    |  213  |
|    1    |  398  |
|    2    |   3   |
+---------+-------+

In [26]:
%%sql

SELECT Property_Area, COUNT(*) as Count

FROM loan_data_clean

GROUP BY Property_Area;

Running query in 'mysql+pymysql://root:***@localhost:3306/loan_1'

3 rows affected.

+---------------+-------+
| Property_Area | Count |
+---------------+-------+
|       2       |  202  |
|       0       |  179  |
|       1       |  233  |
+---------------+-------+